tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "erdaltsksn/tap"

#------------------------------------------------------------------------------#

# Bourne-Again SHell, a UNIX command interpreter
brew "bash"
# UNIX shell (command interpreter)
brew "zsh" # This should have already been installed

# Swiss Army Knife for macOS
brew "m-cli"
# Mac App Store command-line interface
brew "mas"

# Modern replacement for 'ls'
brew "exa"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Command-line fuzzy finder written in Go
brew "fzf"
# Search tool like grep, but optimized for programmers
brew "ack"

# Vi 'workalike' with many additional features
brew "vim"

# Distributed revision control system
brew "git"
# Good-lookin' diffs with diff-highlight and more
brew "diff-so-fancy"
# Semantic Version Bumper using git tag
brew "erdaltsksn/tap/git-bump"

# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# Pinentry for GPG on Mac
brew "pinentry-mac"

# OpenBSD freely-licensed SSH connectivity tools
brew "openssh"
# Utility that provides fast incremental file transfer
brew "rsync"
# Internet file retriever
brew "wget"

#------------------------------------------------------------------------------#

# Platform built on V8 to build network applications
brew "node"

# Interpreted, interactive, object-oriented programming language
brew "python"
# Python dependency management tool
brew "pipenv"

# Open source programming language to build simple/reliable/efficient software
brew "go"
# Configurable static site generator
brew "hugo"

# Powerful, clean, object-oriented scripting language
brew "ruby"

# Random data generator AKA faker
brew "erdaltsksn/tap/random"
# A tool to help you manage GitHub issue labels
brew "erdaltsksn/tap/gh-label"

# Stylesheet Preprocessor
tap "dart-lang/dart"
tap "sass/sass"
brew "sass/sass/sass"

# Drop-in replacement for MySQL
brew "mariadb", restart_service: true
# Object-relational database system
brew "postgresql", restart_service: true
# Persistent key-value database, with built-in net interface
brew "redis", restart_service: true

#------------------------------------------------------------------------------#

# Preview source code files with syntax highlighting.
cask "qlcolorcode"
# Preview image size and resolution.
cask "qlimagesize"
# Preview Markdown files.
cask "qlmarkdown"
# Preview plain text files without or with unknown file extension.
cask "qlstephen"

# FUSE extends macOS's native file system via third-party file systems.
cask "osxfuse"
# AppCleaner is a small application remove leftovers from uninstalled apps.
cask "appcleaner"
# 1Clipboard is a universal clipboard managing app.
cask "1clipboard"
# The Unarchiver is a RAR extractor, and works with dozens of other formats.
cask "the-unarchiver"
# Calibre is a e-book management software.
cask "calibre"
# WhatsApp is a simple, secure, reliable messaging and calling platform.
cask "whatsapp"
# TeamViewer is an app for remote control, desktop sharing, online meetings.
cask "teamviewer"

# Adobe Creative Cloud is a set of applications and services from Adobe Inc.
cask "adobe-creative-cloud"
# ImageOptim makes images load faster.
cask "imageoptim"
# Docker is a virtualization to deliver software in packages called containers.
cask "docker"
# Visual Studio Code is a cross-platform source code editor.
cask "visual-studio-code"
# TablePlus is an modern native SQL client and a database administration tool.
cask "tableplus"
# Google Chrome is a freeware web browser developed by Google.
cask "google-chrome"
# Firefox Developer Edition is a browser made for developers by Mozilla.
cask "firefox-developer-edition"
# Transmit is a file transfer client program for macOS. Developed by Panic.
cask "transmit"
# Insomnia is a Collaborative API Client and Design Platform for GraphQL / REST.
cask "insomnia"

#------------------------------------------------------------------------------#

# Pages is a word processor developed Apple.
mas "com.apple.iWork.Pages", id: 409201541
# Numbers is a spreadsheet application developed Apple.
mas "com.apple.iWork.Numbers", id: 409203825
# Keynote is a presentation software application developed Apple.
mas "com.apple.iWork.Keynote", id: 409183694

# AdGuard for Safari brings back the high quality ad blocking back to Safari.
mas "AdGuard for Safari", id: 1440147259
# Grammarly is a digital writing tool using AI and natural language processing.
mas "Grammarly for Safari", id: 1462114288

# iMovie is a video editing software application sold.
mas "com.apple.iMovieApp", id: 408981434

# Xcode is an integrated development environment for macOS developed.
mas "com.apple.dt.Xcode", id: 497799835
